erp3l/src/Catalogs/ПравилаИмпортаТаблиц/ПравилаИмпортаТаблиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаИмпортаТаблиц</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПриемникПолноеИмяМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникВладелецТабличнойЧасти</name>
    <type>
      <types>DocumentRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>ChartOfAccountsRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемникРодительСправочника</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаXML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаблицаADO</name>
    <type>
      <types>CatalogRef.ТаблицыADO</types>
    </type>
  </attributes>
  <attributes>
    <name>СохраненнаяНастройкаXML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Условие</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Первые1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторПравилаИмпорта</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Соединения</name>
    <attributes>
      <name>Таблица</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДобавочныеПоля</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеНеСтрока</name>
      <type>
        <types>Boolean</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипСтрока</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/СоответствиеВнешнимИБ/СоответствиеВнешнимИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СоответствиеВнешнимИБ</name>
  <basedOn>Catalog.ПеречисленияБД</basedOn>
  <basedOn>Catalog.СправочникиБД</basedOn>
  <owners>Catalog.ТипыБазДанных</owners>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОбъектаВИБ</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
      <types>CatalogRef.ПеречисленияБД</types>
      <types>CatalogRef.СправочникиБД</types>
      <types>CatalogRef.ПланыСчетовБД</types>
      <types>CatalogRef.ТабличныеЧастиБД</types>
      <types>CatalogRef.ПланыВидовХарактеристикБД</types>
      <types>CatalogRef.РегистрыСведенийБД</types>
      <types>CatalogRef.ТаблицыADO</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаКонсолидации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаВИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОбменаДокументами</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоВидыСубконто</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОперандаИнтерфейс</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаблицаСоответствияВИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоддерживатьИерархиюВИБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизацияПоGUID</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцедураПередЗаписью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КорневойКаталог</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСоответствияРодитель</name>
    <type>
      <types>CatalogRef.СоответствиеВнешнимИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОбъектаТек</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
      <types>CatalogRef.ПеречисленияБД</types>
      <types>CatalogRef.СправочникиБД</types>
      <types>CatalogRef.ПланыСчетовБД</types>
      <types>CatalogRef.ТабличныеЧастиБД</types>
      <types>CatalogRef.ПланыВидовХарактеристикБД</types>
      <types>CatalogRef.РегистрыСведенийБД</types>
      <types>CatalogRef.ТаблицыADO</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмерениеРегистраВИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзмерениеРегистраТек</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеНеактуальны</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоИерархииВИБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеРеквизитов</name>
    <attributes>
      <name>РеквизитОбъектаКонсолидации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитОбъектаВнешнейИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеИспользоватьДляСинхронизации</name>
      <comment>Ключевой = НЕ НеИспользоватьДляСинхронизации и Сопоставлено</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкаСоответствия</name>
      <type>
        <types>CatalogRef.СоответствиеВнешнимИБ</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользованиеКонсолидация</name>
      <type>
        <types>EnumRef.ИспользованиеРеквизита</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользованиеВИБ</name>
      <type>
        <types>EnumRef.ИспользованиеРеквизита</types>
      </type>
    </attributes>
    <attributes>
      <name>ПримитивныйТип</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТаблицаАналитики</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаблицаАналитикиВИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗаполнения</name>
      <type>
        <types>EnumRef.СпособыЗаполненияПолейИсточника</types>
      </type>
    </attributes>
    <attributes>
      <name>ФиксированноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользованиеКонсолидация1</name>
      <type>
        <types>EnumRef.ИспользованиеРеквизита</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствиеЗначенийПеречислений</name>
    <attributes>
      <name>ЗначениеВнешнейИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеВнешнейИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеТекущейИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеТекущейИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияСвязанныхОбъектов</name>
    <attributes>
      <name>ТипОбъектаВИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОбъектаВИБ</name>
      <type>
        <types>CatalogRef.ТабличныеЧастиБД</types>
        <types>CatalogRef.РегистрыСведенийБД</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбъектаТек</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОбъектаТек</name>
      <type>
        <types>CatalogRef.ТабличныеЧастиБД</types>
        <types>CatalogRef.РегистрыСведенийБД</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкаСоответствия</name>
      <type>
        <types>CatalogRef.СоответствиеВнешнимИБ</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзмерениеРегистраВИБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзмерениеРегистраТек</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/CommonModules/ОбработкаФайловMicrosoftExcelВызовСервераУХ/Module.bsl
Функция ПолучитьОтборСтроковыхКолонокПравилаИмпортаДанных(ПравилоИмпортаДанных) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПравилоИмпортаДанных);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПравилаИмпортаТаблиц.ТаблицаADO.Имя КАК ИмяТаблицы,
	|	ПравилаИмпортаТаблиц.ПравилаXML
	|ИЗ
	|	Справочник.ПравилаИмпортаТаблиц КАК ПравилаИмпортаТаблиц
	|ГДЕ
	|	ПравилаИмпортаТаблиц.Ссылка = &Ссылка";
	
	НачатьТранзакцию();
	РезультатЗапроса = Запрос.Выполнить();
	ЗафиксироватьТранзакцию();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Выборка.ПравилаXML);
	Правила = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	
	ИмяОсновнойТаблицы = Выборка.ИмяТаблицы;
	
	Отбор = Новый Соответствие;
	
	xlGeneralFormat = 1;
	xlTextFormat = 2;
	
	Для Каждого Правило Из Правила Цикл
		
		Если ПустаяСтрока(Правило.ПриемникИскатьПоИмя) Тогда
			ТипПриемника = Правило.ПриемникТип;
		Иначе
			ТипПриемника = Правило.ПриемникИскатьПоТип;
		КонецЕсли;
		
		Если ТипПриемника.Типы().Найти(Тип("Строка")) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Точка = СтрНайти(Правило.ИсточникИмя, ".");
		
		Если Точка > 0 Тогда
			Таблица = Лев(Правило.ИсточникИмя, Точка - 1);
			Поле = Сред(Правило.ИсточникИмя, Точка + 1);
		Иначе
			Таблица = ИмяОсновнойТаблицы;
			Поле = Правило.ИсточникИмя;
		КонецЕсли;
		
		Таблица = СтрЗаменить(СтрЗаменить(Таблица, "[", ""), "]", ""); 
		Поле = СтрЗаменить(СтрЗаменить(Поле, "[", ""), "]", "");
		
		МассивКолонокТаблицы = Отбор[Таблица];
		Если МассивКолонокТаблицы = Неопределено Тогда
			МассивКолонокТаблицы = Новый Массив();
			Отбор.Вставить(Таблица, МассивКолонокТаблицы);
		КонецЕсли;
		
		МассивКолонокТаблицы.Добавить(Поле);
		
	КонецЦикла; 
	
	Возврат Отбор;
	
КонецФункции

Функция ПолучитьОписаниеПолейДляQueryTables(АдресХранилища, Excel2003, Отбор) Экспорт
	
	ИмяФайла = ПолучитьИмяВременногоФайла(?(Excel2003, "xls", "xlsx"));
	
	ПолучитьИзВременногоХранилища(АдресХранилища).Записать(ИмяФайла);
	
	СтрокаСоединения = "Driver={Microsoft Excel Driver (*.xls, *.xlsx, *.xlsm, *.xlsb)};DBQ=" + ИмяФайла;
	
	СтруктураТаблиц = УправлениеСоединениямиВИБУХ.ПолучитьСтруктуруADO(СтрокаСоединения);
	
	РаботаСФайламиУХ.УдалитьФайлыАсинхронно(ИмяФайла);
	
	ОписаниеПолей = Новый Соответствие;
	
	xlGeneralFormat = 1;
	xlTextFormat = 2;
	
	Для Каждого ЭлементОтбора Из Отбор Цикл
		
		Таблица = ЭлементОтбора.Ключ;
		
		СтрокаСтруктуры = СтруктураТаблиц.Найти(Таблица, "Имя");
		
		Если СтрокаСтруктуры = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		КолонкиСтруктуры = СтрокаСтруктуры.Колонки;
		
		МассивКолонокТаблицы = Новый Массив(КолонкиСтруктуры.Количество());
		Для Инд = 0 По МассивКолонокТаблицы.ВГраница() Цикл
			МассивКолонокТаблицы[Инд] = xlGeneralFormat;
		КонецЦикла; 
		ОписаниеПолей.Вставить(Таблица, МассивКолонокТаблицы);
		
		Для Каждого Поле Из ЭлементОтбора.Значение Цикл
			
			КолонкаСтруктуры = КолонкиСтруктуры.Найти(Поле, "Имя");
			
			Если КолонкаСтруктуры = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			МассивКолонокТаблицы[КолонкиСтруктуры.Индекс(КолонкаСтруктуры)] = xlTextFormat;
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	Возврат ОписаниеПолей;
		
КонецФункции

Функция ПолучитьОтборСтроковыхКолонокПравилаОбработки(ПравилоОбработки) Экспорт
	
	Запрос=Новый Запрос;
	//Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ИсточникиДанныхДляРасчетовПравилаИспользованияПолейЗапроса.НастройкаСоответствия.ОписаниеОбъектаВИБ КАК ОписаниеОбъектаВИБ
	//|ПОМЕСТИТЬ ИспользуемыеТаблицыADO
	//|ИЗ
	//|	Справочник.ИсточникиДанныхДляРасчетов.ПравилаИспользованияПолейЗапроса КАК ИсточникиДанныхДляРасчетовПравилаИспользованияПолейЗапроса
	//|ГДЕ
	//|	ИсточникиДанныхДляРасчетовПравилаИспользованияПолейЗапроса.Ссылка.НазначениеРасчетов = &ПравилоОбработки
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СоответствиеВнешнимИБ.ОписаниеОбъектаВИБ.Имя КАК ИмяТаблицы,
	//|	СоответствиеВнешнимИБ.ИмяОбъектаМетаданных,
	//|	СоответствиеВнешнимИБ.СоответствиеРеквизитов.(
	//|		РеквизитОбъектаКонсолидации,
	//|		РеквизитОбъектаВнешнейИБ,
	//|		ПримитивныйТип
	//|	),
	//|	СоответствиеВнешнимИБ.ТипОбъектаКонсолидации
	//|ИЗ
	//|	Справочник.СоответствиеВнешнимИБ КАК СоответствиеВнешнимИБ
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИспользуемыеТаблицыADO КАК ИспользуемыеТаблицыADO
	//|		ПО СоответствиеВнешнимИБ.ОписаниеОбъектаВИБ = ИспользуемыеТаблицыADO.ОписаниеОбъектаВИБ";
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Спр.Ссылка
	|ПОМЕСТИТЬ Табл
	|ИЗ
	|	Справочник.ИсточникиДанныхДляРасчетов КАК Спр
	|ГДЕ
	|	Спр.НазначениеРасчетов = &ПравилоОбработки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИсточникиДанныхДляРасчетовПравилаИспользованияПолейЗапроса.НастройкаСоответствия.ОписаниеОбъектаВИБ КАК ОписаниеОбъектаВИБ
	|ПОМЕСТИТЬ ИспользуемыеТаблицыADO
	|ИЗ
	|	Справочник.ИсточникиДанныхДляРасчетов.ПравилаИспользованияПолейЗапроса КАК ИсточникиДанныхДляРасчетовПравилаИспользованияПолейЗапроса
	|ГДЕ
	|	ИсточникиДанныхДляРасчетовПравилаИспользованияПолейЗапроса.Ссылка В
	|			(ВЫБРАТЬ
	|				Табл.Ссылка
	|			ИЗ
	|				Табл)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоответствиеВнешнимИБ.ОписаниеОбъектаВИБ.Имя КАК ИмяТаблицы,
	|	СоответствиеВнешнимИБ.ИмяОбъектаМетаданных,
	|	СоответствиеВнешнимИБ.СоответствиеРеквизитов.(
	|		РеквизитОбъектаКонсолидации,
	|		РеквизитОбъектаВнешнейИБ,
	|		ПримитивныйТип
	|	),
	|	СоответствиеВнешнимИБ.ТипОбъектаКонсолидации
	|ИЗ
	|	Справочник.СоответствиеВнешнимИБ КАК СоответствиеВнешнимИБ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИспользуемыеТаблицыADO КАК ИспользуемыеТаблицыADO
	|		ПО СоответствиеВнешнимИБ.ОписаниеОбъектаВИБ = ИспользуемыеТаблицыADO.ОписаниеОбъектаВИБ";
	
	
	Запрос.УстановитьПараметр("ПравилоОбработки",ПравилоОбработки);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	ДанныеДляКонвертации=Новый Соответствие;
	
	Пока Результат.Следующий() Цикл
		
		МассивКолонокТаблицы = ДанныеДляКонвертации[Результат.ИмяТаблицы];
		
		Если МассивКолонокТаблицы = Неопределено Тогда
			
			МассивКолонокТаблицы = Новый Массив();
			ДанныеДляКонвертации.Вставить(Результат.ИмяТаблицы, МассивКолонокТаблицы);
			
		КонецЕсли;
		
		МассивСтроковыхРеквизитов=Новый Массив;
		
		Если Результат.ТипОбъектаКонсолидации="Справочник" Тогда
			
			МетаданныеОбъекта=Метаданные.Справочники[Результат.ИмяОбъектаМетаданных];
			
		ИначеЕсли Результат.ТипОбъектаКонсолидации="ПланВидовХарактеристик" Тогда
			
			МетаданныеОбъекта=Метаданные.ПланыВидовХарактеристик[Результат.ИмяОбъектаМетаданных];
			
		ИначеЕсли Результат.ТипОбъектаКонсолидации="ВидСубконто" Тогда
			
			МетаданныеОбъекта = ОбщегоНазначенияУХ.ПолучитьСправочникПоВидуСубконто(Результат.ИмяОбъектаМетаданных);
			
			Если СтрНайти(МетаданныеОбъекта.ПолноеИмя(),"Перечисление.")>0 Тогда
				
				МассивСтроковыхРеквизитов.Добавить("Наименование");
				МетаданныеОбъекта=Неопределено;
				
			КонецЕсли;	
			
		ИначеЕсли Результат.ТипОбъектаКонсолидации="Документ" Тогда 
		
			МетаданныеОбъекта = МетаДанные.Документы[Результат.ИмяОбъектаМетаданных];
			
		ИначеЕсли Результат.ТипОбъектаКонсолидации="Перечисление" Тогда
			
			МассивСтроковыхРеквизитов.Добавить("Наименование");
			МетаданныеОбъекта=Неопределено;
			
		КонецЕсли;
		
		Если НЕ МетаданныеОбъекта=Неопределено Тогда
			
			Для Каждого Реквизит ИЗ МетаданныеОбъекта.Реквизиты Цикл
				
				Если Реквизит.Тип.Типы()[0]=Тип("Строка") Тогда
					
					МассивСтроковыхРеквизитов.Добавить(Реквизит.Имя);
					
				КонецЕсли;
				
			КонецЦикла;
			
			Для Каждого Реквизит ИЗ МетаданныеОбъекта.СтандартныеРеквизиты Цикл
				
				Если Реквизит.Тип.Типы()[0]=Тип("Строка") Тогда
					
					МассивСтроковыхРеквизитов.Добавить(Реквизит.Имя);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ДанныеСинхронизации=Результат.СоответствиеРеквизитов.Выбрать();
		
		Пока ДанныеСинхронизации.Следующий() Цикл
			
			Если (НЕ МассивСтроковыхРеквизитов.Найти(ДанныеСинхронизации.РеквизитОбъектаКонсолидации)=Неопределено)
				И МассивКолонокТаблицы.Найти(ДанныеСинхронизации.РеквизитОбъектаВнешнейИБ)=Неопределено Тогда
				
				МассивКолонокТаблицы.Добавить(СтрЗаменить(СтрЗаменить(ДанныеСинхронизации.РеквизитОбъектаВнешнейИБ, "[", ""), "]", ""));
				
			КонецЕсли;
			
		КонецЦикла;
			
	КонецЦикла;
	
	Возврат ДанныеДляКонвертации;
	
КонецФункции // ПолучитьОтборСтроковыхКолонокПравилаОбработки()
